Repository: MetaModels/attribute_text
Catalog: src/Resources/translations/*_metamodel_dcasetting.*.xlf
Languages: de

# rgxp.description
source: Validates the field against a regular expression.
de: Validierung des Feldes mit Regular Expression

# rgxp_options.digit
source: Numeric characters
de: Numerische Zeichen

# rgxp_description.digit
source: Allows numeric characters only (including full stop [.] and minus [-])
de: erlaubt nur numerische Zeichen (einschließlich Punkt [.] und Minus [-])

# rgxp_options.natural
source: Non-negative natural numbers
de: Nichtnegative natürliche Zahlen

# rgxp_description.natural
source: Allows non-negative natural numbers (including 0)
de: erlaubt nicht-negative natürliche Zahlen (einschließlich 0)

# rgxp_options.alpha
source: Alphabetic characters
de: Alphabetische Zeichen

# rgxp_description.alpha
source: Allows alphabetic characters only (including full stop [.] minus [-] and space [ ])
de: erlaubt nur alphabetische Zeichen (einschließlich Punkt [.], Minus [-] und Leerzeichen [ ])

# rgxp_options.alnum
source: Alphanumeric characters
de: Alphanumerische Zeichen

# rgxp_description.alnum
source: Allows alphanumeric characters only (including full stop [.] minus [-], underscore [_] and space [ ])
de: erlaubt nur alphanumerische Zeichen (einschließlich Punkt [.], Minus [-], Unterstrich [_] und Leerzeichen [ ])

# rgxp_options.extnd
source: Extend special characters
de: Sonderzeichen

# rgxp_description.extnd
source: Disallows #<>()\\=
de: verbietet #<>()\\=

# rgxp_options.date
source: Date
de: Datum

# rgxp_description.date
source: Expects a valid date
de: erwartet ein gültiges Datum

# rgxp_options.time
source: Time
de: Zeit

# rgxp_description.time
source: Expects a valid time
de: erwartet eine gültige Uhrzeit

# rgxp_options.datim
source: Date and time
de: Datum und Uhrzeit

# rgxp_description.datim
source: Expects a valid date and time
de: erwartet ein gültiges Datum und eine gültige Uhrzeit

# rgxp_options.friendly
source: Friendly email
de: E-Mail im "Friendly Name Format"

# rgxp_description.friendly
source: Expects a valid "friendly name format" e-mail address
de: erwartet eine gültige E-Mail-Adresse im "Friendly Name Format".

# rgxp_description.email
source: Expects a valid e-mail address
de: erwartet eine gültige E-Mail Adresse

# rgxp_description.emails
source: Expects a valid list of valid e-mail addresses
de: erwartet eine Liste mit gültigen E-Mail-Adressen

# rgxp_description.url
source: Expects a valid URL
de: erwartet eine gültige URL

# rgxp_description.alias
source: Expects a valid alias
de: erwartet einen gültigen Alias

# rgxp_options.folderalias
source: Folder alias
de: Ordner-Alias

# rgxp_description.folderalias
source: Expects a valid folder URL alias
de: erwartet einen gültigen Alias der Ordner-URL

# rgxp_options.phone
source: Phone
de: Telefonnummer

# rgxp_description.phone
source: Expects a valid phone number (numeric characters, space [ ], plus [+], minus [-], parentheses [()] and slash [/])
de: erwartet eine gültige Telefonnummer (numerische Zeichen, Leerzeichen [ ], Plus [+], Minus [-], Klammern [()] und Schrägstrich [/]

# rgxp_options.prcnt
source: Percent value
de: Prozent-Wert

# rgxp_description.prcnt
source: Allows numbers between 0 and 100
de: erlaubt Zahlen zwischen 0 und 100

# rgxp_options.locale
source: Locale key
de: Locale-Angabe

# rgxp_description.locale
source: Expects a valid locale (e.g. "de-CH")
de: erwartet eine gültige Locale-Angabe (z. B. "de-CH")

# rgxp_options.language
source: Language key
de: Sprachen-Code

# rgxp_description.language
source: Expects a valid language code (e.g. "EN")
de: erwartet einen gültigen Sprachen-Code (z. B. "EN")

# rgxp_options.fieldname
source: Fieldname
de: Feldname

# rgxp_description.fieldname
source: Expects a valid field name
de: erwartet einen gültigen Feldnamen
